ilove737/XS40_CH552T/src/CompositeKM.C
        UEP1_CTRL = bUEP_AUTO_TOG | UEP_R_RES_ACK;
        UEP2_CTRL = bUEP_AUTO_TOG | UEP_R_RES_ACK | UEP_T_RES_NAK;
        USB_DEV_AD = 0x00;
        UIF_SUSPEND = 0;
        UIF_TRANSFER = 0;
        UIF_BUS_RST = 0; //清中断标志
    }
    if (UIF_SUSPEND) //USB总线挂起/唤醒完成
    {
        UIF_SUSPEND = 0;
        if (USB_MIS_ST & bUMS_SUSPEND) //挂起
        {
#if DEBUG
            printf("zz"); //睡眠状态
#endif
            //             while ( XBUS_AUX & bUART0_TX );                              //等待发送完成
            //             SAFE_MOD = 0x55;
            //             SAFE_MOD = 0xAA;
            //             WAKE_CTRL = bWAK_BY_USB | bWAK_RXD0_LO;                      //USB或者RXD0有信号时可被唤醒
            //             PCON |= PD;                                                  //睡眠
            //             SAFE_MOD = 0x55;
            //             SAFE_MOD = 0xAA;
            //             WAKE_CTRL = 0x00;
        }
    }
    else
    {                      //意外的中断,不可能发生的情况
        USB_INT_FG = 0xFF; //清中断标志
                           //      printf("UnknownInt  N");
    }
}

// void HIDValueHandle()
// {
//     UINT8 i;

//     i = getkey();
//     // printf("%c", (UINT8)i);
//     // i = 'A';
//     switch (i)
//     {
//         //鼠标数据上传示例
//     case 'L': //左键
//         HIDMouse[0] = 0x01;
//         Enp2IntIn();
//         HIDMouse[0] = 0;
//         break;
//     case 'R': //右键
//         HIDMouse[0] = 0x02;
//         Enp2IntIn();
//         HIDMouse[0] = 0;
//         break;
//         //键盘数据上传示例
//     case 'A': //A键
//         FLAG = 0;
//         HIDKey[2] = 0x1d; //按键开始
//         Enp1IntIn();
//         HIDKey[2] = 0; //按键结束
//         while (FLAG == 0)
//         {
//             ; /*等待上一包传输完成*/
//         }
//         Enp1IntIn();
//         break;
//     case 'P': //P键
//         FLAG = 0;
//         HIDKey[2] = 0x38;
//         Enp1IntIn();
//         HIDKey[2] = 0; //按键结束
//         while (FLAG == 0)
//         {
//             ; /*等待上一包传输完成*/
//         }
//         Enp1IntIn();
//         break;
//     case 'Q': //Num Lock键
//         FLAG = 0;
//         HIDKey[2] = 0x39;
//         Enp1IntIn();
//         HIDKey[2] = 0; //按键结束
//         while (FLAG == 0)
//         {
//             ; /*等待上一包传输完成*/
//         }
//         Enp1IntIn();
//         break;
//     default:                                                     //其他
//         UEP1_CTRL = UEP1_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_NAK; //默认应答NAK
//         UEP2_CTRL = UEP2_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_NAK; //默认应答NAK
//         break;
//     }
// }

// void sendKeyHID(UINT8 *Frames)
// {
//     memcpy(HIDKey, Frames, 8);
//     Enp1IntIn();
// }
